# 定义字符串列表
Sect_pos= [
["p101", "云剑探云", "斗转星移", "木灵印", "崩拳戳", "探云", ],
["p102", "云剑飞刺", "星罗棋布", "木灵芽", "崩拳封", "飞刺", ],
["p103", "云剑厚土", "星弈挡", "火灵印", "崩拳弹", "星奔挡", "厚土", "人灵印", ],
["p104", "轻剑", "星弈夹", "火灵窜", "锻拳", "星奔夹", ],
["p105", "护身灵气", "震卦", "土灵印", "劈山掌", "身灵气", ],
["p106", "灵气灌注", "坤卦", "土灵碎", "抱气法", "碎", ],
["p107", "巨虎灵剑", "巽卦", "金灵印", "罗刹扑", ],
["p108", "震雷剑", "掌心雷", "金灵针", "破空爪", "雷剑", ],
["p109", "剑劈", "白鹤亮翅", "水灵印", "千斤坠", ],
["p110", "剑挡", "揽雀尾", "水灵涛","起势", ],
["p111", "飞牙剑", "野马分鬃", "五行刺", "朝气蓬勃", "野马", ],
["p112", "骤风剑", "藕断丝连", "血气方刚", ],
["p201", "云剑回守", "飞星刺", "木灵复苏", "崩拳撼", "回守", ],
["p202", "云剑极意", "星弈点", "木灵疏影", "崩拳缠", "星奔点", ],
["p203", "云剑无锋", "星弈立", "火灵聚炎", "崩拳突", "星奔立", ],
["p204", "化灵诀", "艮卦", "火灵赤焰", "锻筋", ],
["p205", "引气剑", "坎卦", "土灵阵", "探马掌", ],
["p206", "巨鲸灵剑", "落雷术", "土灵群山", "风冥爪", ],
["p207", "凝意诀", "斩草除根", "金灵阵", "夜鬼啸", "凝意", ],
["p208", "灵犀剑阵", "金鸡独立", "金灵穿心", "岿然不动", "然不动", ],
["p209", "地煞剑", "静气心法", "水灵波澜", "势大力沉", ],
["p210", "形意剑", "落花有意", "水灵汹涌", "气沉丹田", ],
["p211", "狂剑一式", "气贯长虹", "浑天印", "浩然正气", "狂剑一", ],
["p301", "云剑柔心", "众星拱月", "木灵阵", "崩天步", ],
["p302", "云剑无妄", "星弈打", "木灵巡林", "崩拳截脉", "星打", "星奔打", ],
["p303", "云剑点星", "兑卦", "火灵阵", "崩拳降龙", "点星", ],
["p304", "云剑汇灵", "白蛇吐信", "火灵轰爆", "锻骨", "白蛇", "汇灵", ],
["p305", "云舞诀", "御雷卦诀", "土灵扬尘", "荷重前行", ],
["p306", "暗鸦灵剑", "两仪阵", "土灵断崖", "迎风掌", ],
["p307", "破气剑", "流水无情", "金灵蓄锐", "饿虎扑食", ],
["p308", "巨鹏灵剑", "气疗术", "金灵锋芒", "双鬼拍门", ],
["p309", "反身剑", "枯木逢春", "水灵阵", "气若悬河", "枯木", ],
["p310", "镜花剑阵", "螳螂捕蝉", "水灵泉涌", "踏破九霄", "踏破", ],
["p311", "三峰剑", "海底捞月", "五行流转", "势如破竹", "峰剑", "三峰", ],
["p401", "云剑闪风", "星弈飞", "木灵暗香", "崩灭心法", "星奔飞", ],
["p402", "云剑月影", "星弈虎", "木灵玫刺", "崩拳寸劲", "星奔虎", ],
["p403", "聚灵心法", "六爻绝阵", "火灵瞬燃", "崩拳连崩", "绝阵", ],
["p404", "百鸟灵剑诀", "离卦", "火灵灼心", "锻髓", ],
["p405", "白鹭灵剑", "星轨推衍", "土灵绝壁", "鹤步", "星轨", ],
["p406", "巨鲲灵剑", "蜻蜓点水", "土灵流沙", "灵玄迷踪步", "巨鲲", ],
["p407", "灵感剑", "轰雷掣电", "金灵飞梭", "冥影身法", "轰雷", ],
["p408", "流云乱剑", "反震心法", "金灵铁骨", "玄手夺魂", ],
["p409", "水月剑阵", "金蝉脱壳", "水灵腾浪", "冲霄破浪", "脱壳", ],
["p410", "狂剑二式", "杯弓蛇影", "水灵潜遁", "磅礴之势", ],
["p411", "混元碎击", ],
["p501", "云剑游龙", "天元心法", "木灵柳纷飞", "崩拳闪击", "云剑游", ],
["p502", "云剑凌波", "星弈断", "火灵烈燎原", "崩拳惊触", "星奔断", ],
["p503", "飞灵闪影剑", "乾卦", "土灵合八荒", "锻神开海", "开海", "飞灵", "闪影", ],
["p504", "万法归灵剑", "五雷轰顶", "金灵巨鼎落", "百杀破境掌", "百杀", ],
["p505", "剑意激荡", "梅开二度", "水灵纳百川", "修罗吼", ],
["p506", "御空剑阵", "气吞山河", "混元无极阵", "玄心斩魄", "吞山"],
["p507", "连环剑阵", "黄雀在后", "五行天髓诀", "威震四方", ],
["p508", "狂剑零式", "紫气东来", "天地浩荡", ],
]
Sidjob_type=[
["Elixir", "地灵丹", "培元丹", "小还丹", "锻体丹", "飞云丹", "驱邪丹", "还魂丹", "疗伤丹", "神力丹", "大还丹", "聚灵丹", "洗髓丹", "冰灵护体丹", "锻体玄丹", "悟道丹", "云丹", ],
["Fulu", "奔雷符", "护灵符", "锐金符", "火云符", "清心咒", "水气符", "寒冰咒", "吸灵符", "瘴气符", "聚气咒", "扰心符", "弱体符", "万邪入体咒", "镇魂封元符", "千里神行符", ],
["Music", "破音", "土行曲", "逍遥曲", "慈念曲", "幻音曲", "天灵曲", "断肠曲", "轮指连音", "狂舞曲", "九煞破灵曲", "回春曲", "同心曲", "天音困仙曲", "幽绪乱心曲", "转弦合调", ],
["Paint", "调色", "练笔", "研墨", "笔走龙蛇", "画饼充饥", "画蛇添足", "挥毫泼墨", "灵感迸发", "以画入道", "触类旁通", "神来之笔", "落纸云烟", "运笔如飞", "画龙点晴", "妙笔生花", "灵感进发", "充饥", "添足",],
["Formation", "冲击阵纹", "引雷阵", "碎杀阵", "疗愈阵纹", "龟甲阵", "邪蛊阵", "周天剑阵", "辟邪阵纹", "聚灵阵", "天罡聚力阵", "八门金锁阵", "不动金刚阵", "万花迷魂阵", "回响阵纹", "须弥阵纹", ],
["Plant", "归元草", "金梭兰", "剑枝竹", "神力草", "神秘种子", "叶盾花", "愈甘菊", "灵植浇灌", "向灵葵", "飞枭灵芝", "穿肠紫蕨", "冰封雪莲", "玄韵道果", "空间灵田", "缚仙古藤", ],
["Fortune", "天谕守", "天谕攻", "卜命", "察体", "避凶", "趋吉", "探灵", "凶象", "重现", "飞逝", "吉运初显", "血光之灾", "诸事不宜", "牵引", "御心", "万事如意", "顺应", "逆施", "厄劫缠身", "命运轮回", "天运", "天心", "天命", "天谕", ],
]
Sidejob_pos=[
["sp11", "地灵丹", "奔雷符", "破音", "调色", "引雷阵", "归元草", "卜命", ],
["sp12", "培元丹", "护灵符", "土行曲", "练笔", "碎杀阵", "金梭兰", "察体", "护灵", ],
["sp13", "小还丹", "锐金符", "逍遥曲", "研墨", "冲击阵纹", "剑枝竹", "天谕守", "天谕攻", "天谕", ],
["sp21", "锻体丹", "火云符", "慈念曲", "笔走龙蛇", "龟甲阵", "神力草", "探灵", ],
["sp22", "飞云丹", "清心咒", "幻音曲", "画饼充饥", "邪蛊阵", "神秘种子", "凶象", "充饥", "云丹, "],
["sp23", "驱邪丹", "水气符", "天灵曲", "画蛇添足", "疗愈阵纹", "叶盾花", "避凶", "趋吉", "天运", "添足", ],
["sp31", "还魂丹", "寒冰咒", "断肠曲", "挥毫泼墨", "聚灵阵", "愈甘菊", "吉运初显", ],
["sp32", "疗伤丹", "吸灵符", "狂舞曲", "灵感迸发", "周天剑阵", "灵植浇灌", "血光之灾", "灵感进发", ],
["sp33", "神力丹", "瘴气符", "轮指连音", "以画入道", "辟邪阵纹", "向灵葵", "飞逝", "重现", "天命", ],
["sp41", "大还丹", "聚气咒", "回春曲", "触类旁通", "天罡聚力阵", "飞枭灵芝", "万事如意", ],
["sp42", "聚灵丹", "扰心符", "九煞破灵曲", "神来之笔", "八门金锁阵", "穿肠紫蕨", "诸事不宜", ],
["sp43", "洗髓丹", "弱体符", "同心曲", "落纸云烟", "不动金刚阵", "冰封雪莲", "牵引", "御心", "天心", ],
["sp51", "冰灵护体丹", "万邪入体咒", "天音困仙曲", "运笔如飞", "万花迷魂阵", "玄韵道果", "厄劫缠身", ],
["sp52", "锻体玄丹", "镇魂封元符", "转弦合调", "画龙点晴", "回响阵纹", "空间灵田", "命运轮回", ],
["sp53", "悟道丹", "千里神行符", "幽绪乱心曲", "妙笔生花", "须弥阵纹", "缚仙古藤", "顺应", "逆施", ],
]

def Match(cardname):
    typ = ""
    pos = ""
    for lst in Sidjob_type:
        if any(item in cardname for item in lst):
            typ = lst[0]
            for lst in Sidejob_pos:
                if any(item in cardname for item in lst):
                    pos = lst[0]
                    break
            break
    if not pos:
        for lst in Sect_pos:
            if any(item in cardname for item in lst):
                typ = "Sect"
                pos = lst[0]
                break
    if not pos:
        typ = "err"
        pos = cardname
    # print("typ:", typ, "pos:", pos)
    return typ, pos